var firstPartCityName = ["Ав", "Аль", "Ва", "Иль", "Ти", "Фо", "Че", "Ан", "Ба", "Го", "Вин", "Ме", "Ми", "Нар", "Тан", "Ут", "Хи", "Анд", "Ар", "Ни", "Он", "Ром", "Эль", "Агл", "Анн", "Бел", "Бри", "Из",
						 "Кал", "Ка", "Ло", "Лих", "Ми", "Мит", "Мо", "Но", "Осг", "Пел", "При", "Рив", "Та", "Ум", "Фор", "Ха", "Хоб", "Эгл", "Эт", "Дур", "Гун"];
var secondPartCityName = ["алл", "ква", "лима", "рио", "мено", "тог", "бан", "арад", "доли", "яма", "нег", "нас", "отро", "умн", "мрин", "уни", "енел", "дамо", "далон", "арон", "ум", "ег", "томб",
						 "нгар", "эмбе", "нхи", "нас", "тлон", "чел", "гили", "ло", "бито", "нбур", "арес", "орас", "бор"];
var thirdPatrCityName = ["нэ", "дэ", "ар", "ин", "он", "ос", "са", "нд", "ас", "гин", "мар", "онд", "ион", "им", "но", "нг", "иэ", "лос", "то", "а", "ар", "т", "ард", "ль", "эр", "г", "ия", "иат",
						 "д", "инг", "анг", "от"];
