var firstPartName = ['Аг', 'Аив', "Аки", "Ам", "Ану", "Апр", "Арв", "Ах", "А", "Ба", "Бо", "Бу", "Ва", "Вла", "Ву", "Гек", "Гер", "Гим", "Гип", "Дио", "Ди", "Дми", "Зе", "Ер", "Зи", "Ик", "Ил", "Ир", "Ис",
					 "Лю", "Ман", "Мар", "Мел", "Ме", "Мер", "Мо", "Не", "Нер", "Ни", "Но", "Од", "Оди", "Ор", "Орк", "Орф", "Па", "Пар", "Пе", "Пен", "Пер", "Пл", "При", "Пр", "Ра", "Рам", "Ре", "Са", 
					 "Сат", "Сер", "Си", "Силь", "Сим", "Ска", "Стр", "Та", "Тел", "Тер", "Тин", "Тиф", "Ур", "Фав", "Фаэ", "Фе", "Фен", "Фо", "Ха", "Хар", "Цер", "Ци", "Эв", "Эвр", "Эге", "Эл", "Эо", 
					 "Ян", "Я"];
var secondPartName = ["асф", "д", "вил", "бро", "олл", "гу", "ино", "иле", "ху", "ре", "ян", "кх", "аси", "лка", "тор", "лк", "ме", "ио", "итр", "вс", "фи", "одо", "идо", "сто", "ав", "идо", "пту", "ре", 
					  "нто", "сто", "исе", "ест", "ион", "рка", "лид", "дам", "мзе", "льв", "нта", "ле", "дар", "тан", "ур", "кло", "вр", "ге"];
var thirdPartNameMale = ["ей", "он", "ин", "ы", "оп", "к", "ер", "п", "р", "ал", "иф", "ан", "им", "ес", "ор", "ун", "ас", "ул", "ен", "ий", "н"];
var thirdPartNameFemale = ["а", "я", "ия", "ии", "ея", "ио", "йя"];
var firstPartSurname = ["А", "Ав", "Ад", "Аг", "Аи", "Апр", "Анк", "Аши", "Авс", "Адк", "Аик", "Аор", "Б", "Бо", "Бе", "Бу", "Би", "Бри", "Бна", "Блу", "Бза", "Бси", "В", "Ви", "Ва", "Вы", "Ври", "Вуш",
						"Вод", "Вим", "Вке", "Вху", "Вса", "Г", "Гр", "Га", "Гу", "Гру", "Гри", "Гсо", "Гмы", "Гву", "Д", "Е", "Ер", "Ен", "Ео", "Ек", "Ерд", "Едр", "Евс", "Еок", "Ж", "Зло", "Зда", "Зду",
						"Зик", "Зоф", "Зня", "Зкы", "Зус", "И", "Икр", "Иос", "Ина", "Идо", "Игу", "К", "Кре", "Кза", "Кум", "Кот", "Квы", "Кэж","Л", "Лир", "Луд", "Луа", "Лис", "М", "Мор", "Мра", "Мду",
						"Мсе", "Мши", "Н", "Нор", "Нык", "О", "Оза", "Ожи", "П", "Пне", "Пди", "Пав", "Р", "Руз", "Рва", "Рну", "Рог", "Рзый", "С", "Слу", "Сдо", "Сир", "Саш", "Слы", "Т", "Тро", "Три",
						"Ток", "Тза", "Тве", "Тус", "У", "Урл", "Уас", "Удк", "Ф", "Чом", "Хэк", "Х", "Эрс", "Э", "Эро", "Эун"];
var secondPartSurname = ["авар", "аукх", "ап", "аир", "брит", "бику", "бдыш", "вуте", "втур", "волд", "вуза", "вшым", "гриц", "гзот", "гуру", "дров", "дэрп", "дывд", "днар", "еула", "ерза", "еким", "еоси",
						 "етпа" , "жрас", "зуме", "з", "и", "к", "л", "м", "н", "о", "п", "р", "с", "т", "у", "ф", "ч", "ш", "ы", "э", "ю", "я"];
var thirdPartSurname = ["ба", "уа", "ипа", "ич", "ов", "ук", "ски", "ев", "огло", "пулос", "кос", "иди", "ини", "те", "ис", "ман", "ер", "джи", "оглу", "ск", "цк", "арт", "итт", "агг", "онг", "зэ", "яйн",
						"анн", "ссон", "берг", "стед", "из", "аз", "он", "тан", "лю", "дуань", "цяо", "когай", "ада", "ие", "яма", "уки", "ото"];
